function test(array, value) {
    return array.lastIndexOf(value);
}
noInline(test);

const array = [
    "あいうえおかきくけこさしすせそたちつてとなにぬねの",
    "かきくけこさしすせそたちつてとなにぬねのはひふへほ",
    "さしすせそたちつてとなにぬねのはひふへほまみむめも",
    "たちつてとなにぬねのはひふへほまみむめもやゆよらり",
    "なにぬねのはひふへほまみむめもやゆよらりるれろわを",
    "はひふへほまみむめもやゆよらりるれろわをんあいうえ",
    "まみむめもやゆよらりるれろわをんあいうえおかきくけ",
    "やゆよらりるれろわをんあいうえおかきくけこさしすせ",
    "らりるれろわをんあいうえおかきくけこさしすせそたち",
    "わをんあいうえおかきくけこさしすせそたちつてとなに",
    "んあいうえおかきくけこさしすせそたちつてとなにぬね",
    "ひふへほまみむめもやゆよらりるれろわをんあいうえお",
    "ふへほまみむめもやゆよらりるれろわをんあいうえおか",
    "へほまみむめもやゆよらりるれろわをんあいうえおかき",
    "ほまみむめもやゆよらりるれろわをんあいうえおかきく",
    "みむめもやゆよらりるれろわをんあいうえおかきくけこ",
    "むめもやゆよらりるれろわをんあいうえおかきくけこさ",
    "めもやゆよらりるれろわをんあいうえおかきくけこさし",
    "もやゆよらりるれろわをんあいうえおかきくけこさしす",
    "ゆよらりるれろわをんあいうえおかきくけこさしすせそ",
    "よらりるれろわをんあいうえおかきくけこさしすせそた",
    "らりるれろわをんあいうえおかきくけこさしすせそたち",
    "りるれろわをんあいうえおかきくけこさしすせそたちつ",
    "るれろわをんあいうえおかきくけこさしすせそたちつて",
    "れろわをんあいうえおかきくけこさしすせそたちつてと",
    "ろわをんあいうえおかきくけこさしすせそたちつてとな",
];

for (var i = 0; i < testLoopCount; ++i)
    test(array, "もやゆよらりるれろわをん" + "あいうえおかきくけこさしす");
